In [1]:
import pandas as pd

In [2]:
base = pd.read_csv('titanic_train.csv')
base.head(2)

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C

In [3]:
base.tail(2)

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
889,890,1,1,"Behr, Mr. Karl Howell",male,26.0,0,0,111369,30.00,C148,C
890,891,0,3,"Dooley, Mr. Patrick",male,32.0,0,0,370376,7.75,NaN,Q

In [6]:
base.shape
#(linhas,colunas)
# é igual aos eixos X e Y no plano cartesiano (X,Y)

(891, 12)

**O nome já é um pouco intuitivo**
- HEAD > primeiras linhas
- TAIL > ultimas linhas
- SHAPE > caracteristicas da base (X,Y)
- DISPLAY > mostra as 5 primeiras e 5 ultimas
- DTYPES > tipos de dados

In [4]:
base.dtypes

PassengerId      int64
Survived         int64
Pclass           int64
Name            object
Sex             object
Age            float64
SibSp            int64
Parch            int64
Ticket          object
Fare           float64
Cabin           object
Embarked        object
dtype: object

object -> a coluna contém dados de texto ou mistos. Pode incluir strings de texto, datas e até mesmo dados categóricos.

In [13]:
base.isnull().sum()
# somar os valores vazios

# 177 valores v. na idade e 687 na cabine... 2emb

PassengerId      0
Survived         0
Pclass           0
Name             0
Sex              0
Age            177
SibSp            0
Parch            0
Ticket           0
Fare             0
Cabin          687
Embarked         2
dtype: int64

In [5]:
# filtro, se alguem viajou com esposa e filhos
base[(base.Parch > 1 )  & (base.SibSp > 1 )] .head(5)
# da pra usar o .Loc tambem, filtrando especificamente as colunas, em vez da base inteira

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
27,28,0,1,"Fortune, Mr. Charles Alexander",male,19.0,3,2,19950,263.000,C23 C25 C27,S
59,60,0,3,"Goodwin, Master. William Frederick",male,11.0,5,2,CA 2144,46.900,NaN,S
63,64,0,3,"Skoog, Master. Harald",male,4.0,3,2,347088,27.900,NaN,S
68,69,1,3,"Andersson, Miss. Erna Alexandra",female,17.0,4,2,3101281,7.925,NaN,S
71,72,0,3,"Goodwin, Miss. Lillian Amy",female,16.0,5,2,CA 2144,46.900,NaN,S